{
  "basics": {
    "name": "Kimberly Coy",
    "label": "Software Engineer",
    "summary": "Write cool code. Solve interesting problems. Pursue my passion for technology.",
    "picture": "",
    "email": "kimberlycoy@mybluetub.com",
    "phone": "317-752-6206",
    "website": "mybluetub.com",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Indianapolis",
      "countryCode": "US",
      "region": "IN"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "kimberlycoy",
        "url": "https://linkedin.com/in/kimberlycoy"
      },
      {
        "network": "GitHub",
        "username": "kimberlycoy",
        "url": "https://github.com/kimberlycoy"
      }
    ]
  },
  "work": [
    {
      "company": "mybluetub",
      "position": "Software Engineer",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2010-04-01",
      "summary": "Designed and developed web and mobile apps using React for the front end and Firebase to store and sync data. Employed 100% serverless architecture to reduce costs and start-up barriers.  Utilized Google Services to automated business workflow such as automating email responses and tracking business metrics.  Technologies: - React: Designed and developed web and mobile apps - AWS S3/CloudFront: Used to deploy and distribute apps  - Cloud Firestore: Integrated into apps to store and sync data - Google Cloud Functions: Created event triggered functions to maintain and organize Firestore data - AWS Cloud9: Create environment to write, run, and debug code - AWS CodePipeline, CodeBuild: Implemented continuous build, testing, and delivery  - Google Services, Apps Script, Forms, Sheets, Docs: Automated business workflow",
      "highlights": []
    },
    {
      "company": "Praxis Management International",
      "position": "Software Engineer at Eli Lilly and Company",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2012-07-01",
      "summary": "Created apps, APIs, and IoT devices to discover, design, and demonstrate innovations in clinical research. Leveraged cloud services, agile development, and design thinking to rapidly prototype hardware and software solutions.   Technologies: - Angular: Developed web and mobile apps. - iOS: Created iPhone and iPad apps in Swift. - Firebase: Integrated realtime databases into web and iOS apps.  - Jenkins: Configured for testing, continuous integration and delivery. - AWS EC2: Hosted app servers, Nginx, and Jenkins.  - AWS S3/CloudFront: Deployed Single Page Apps. - AWS IoT: Prototyped with AWS IoT buttons. Created IoT shadows for prototyped and third-party devices to integrate them into apps. - AWS Cognito: Integrated with Lilly's Ping Identity to provided federated sign-in for web and iOS apps.  - AWS API Gateway: Configured to front Lambda functions and other app services. - AWS Lambda: Untilized node functions to support web and iOS apps, APIs, and IoT devices.",
      "highlights": [],
      "endDate": "2017-12-01"
    },
    {
      "company": "Chemonics International",
      "position": "Software Engineer / Consultant, Kenya Pharma",
      "area": "Nairobi, Kenya",
      "website": "",
      "startDate": "2010-10-01",
      "summary": "Redesigned and overhauled the kenyapharma.org website, a supply chain management tool and information portal, improving performance, usability, and security.  Moved the code from a custom PHP/MySQL application to the Yii Framework  to speed up and reduce the complexity of development.  Introduced best practices such as source code management, issue tracking, and unit testing.  (LAMP, Yii Framework, Java: Apache POI)  Advised on technical issues such as web hosting, data backup/recovery, and mobile applications.    Migrated the production server to an Amazon EC2 server.  Set up monitoring and automated database and file backups.",
      "highlights": [],
      "endDate": "2013-04-01"
    },
    {
      "company": "ChaCha",
      "position": "Senior Software Engineer",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2010-02-01",
      "summary": "Implemented and validated a direct connection to AT&T's SMS using the SMPP protocol, allowing ChaCha to bypass SMS aggregators for AT&T users. (Java, SMPPAPI)  Developed a RESTful web service using Grails to publish Scribe log files, allowing developers to view and search production logs.  Created a web application to display SMS traffic data from the production environment, allowing staff to analyze data and developers to troubleshoot production issues. This service accessed data across multiple MySQL databases and took into account production performance concerns.",
      "highlights": [],
      "endDate": "2010-04-01"
    },
    {
      "company": "Indigo BioSystems",
      "position": "Senior Software Engineer",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2006-02-01",
      "summary": "Initiated and advocated the use of cloud computing for production and ad hoc needs, such as testing and demos. Used Amazons Web Services EC2 instances (Linux and Windows images) with Elastic Block Storage for data persistence beyond the instance, removing the need for many in- house servers and allowing the organization to take advantage of the high performance, pay-as- you-go pricing model.  Designed and implemented a custom RDF triplestore using a relation database and vertical partitioning, abstracting the SQL statements so that different databases could be used, e.g. MySQL, Oracle, HSQLDB, PostgreSQL. This triplestore served as the foundation for data persistence of Indigo products, freeing developers from the traditional object-relational mapping concerns. (Java, Spring, RDF)  Created a RESTful web service API for Indigo’s custom triplestore, translating SPARQL queries into SQL statements which facilitated the publication of linked data.  Designed Indigo’s lab automation framework, a modularized web-based platform that automates the collection and analysis of lab data. (Java, Spring, JSP)  Developed ontologies to describe lab data collection and analysis. Translated these ontologies into RDF schema. (RDF, RDFS, N-Triple, OWL)  Conducted interviews using Joel on Software’s Smart and Gets Things Done, making hiring decisions for new developers and interns.  Refactored a legacy web-app to use the Spring Framework and hibernate, freeing it from technology lock-in and simplifying the development environment, speeding up development and allowing for more diverse deployment environments. (Java, Spring, Hibernate, Tomcat, Glassfish, Sun AppServer 7, SOAP, Lucene, Centera)",
      "highlights": [],
      "endDate": "2009-12-01"
    },
    {
      "company": "Self Employed",
      "position": "Software Engineer / Consultant at Eli Lilly and Company",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2005-02-01",
      "summary": "Monitored, maintained, continued development of online application from Quovix. (Java, Linux, MySQL, Bash)  Created and documented business processes such as disaster recovery, business continuity, and standard operating procedures to support an on-line application, enhancing the business’ ability to maintain normal operations and consistency of work despite transitioning team members.  Assessed software vendors, making recommendations concerning each vender’s technical and project management skills for an organization seeking to replace a former service provider, allowing management to select a new development partner with confidence and implement a smooth transition to the new vendor.",
      "highlights": [],
      "endDate": "2006-02-01"
    },
    {
      "company": "Quovix",
      "position": "Software Engineer",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2000-01-01",
      "summary": "Developed the Quovix platform, an on-line collaboration application for managing and developing software using remote development teams. Functionality included: issue and milestone tracking, file sharing, discussion forums, and bidding. The platform allowed Quovix to utilize experts from across the world to deliver software products. (Java, Enhydra, MySQL)  Internationalized a large web-application into 7 languages (English, Chinese, Russian, German, Spanish, Japanese, and Korean). Coordinated technical and language requirements between management and translation teams. Configured production servers to handle the new languages and successfully deployed the new localized application, allowing international users to view the site in their local language.  Monitored and maintained an on-line application consisting of load balanced web servers and two hot backup databases servers. Installed and configured Apache web server, Enhydra Application Server, MySQL database server, and other applications. Wrote monitor scripts and troubleshot issues, maintaining a 99.9% uptime for the production environment.",
      "highlights": [],
      "endDate": "2005-01-01"
    },
    {
      "company": "Peace Corps",
      "position": "Volunteer Leader",
      "area": "Dar es Salam, Tanzania",
      "website": "",
      "startDate": "1998-12-01",
      "summary": "Represented Peace Corps volunteers as an integral part of a multi-cultural education team. Facilitated in-service and pre-service training programs for Peace Corps volunteers and their Tanzanian counterparts.  Led a team of volunteers in the facilitation of in-service and pre-service training programs for Peace Corps Volunteers and their Tanzanian counterparts, increasing the facilitators’ presentation skills and strengthening participants’ teaching skills.",
      "highlights": [],
      "endDate": "1999-12-01"
    },
    {
      "company": "Peace Corps",
      "position": "Volunteer",
      "area": "Iringa, Tanzania",
      "website": "",
      "startDate": "1996-09-01",
      "summary": "Taught advanced mathematics program for 217 Tanzanian high school students for a two-year period, improving self-esteem, study skills, and cross-cultural understanding.",
      "highlights": [],
      "endDate": "1998-12-01"
    }
  ],
  "education": [
    {
      "institution": "Peace Corps",
      "area": "Arusha, Tanzania",
      "studyType": "B.S. Equivalent Education/Training",
      "startDate": "1995-12-31",
      "gpa": "",
      "courses": [],
      "endDate": "1995-12-31"
    },
    {
      "institution": "Peace Corps",
      "area": "Arusha, Tanzania",
      "studyType": "B.S. Equivalent Swahili Language/Culture",
      "startDate": "1995-12-31",
      "gpa": "",
      "courses": [],
      "endDate": "1995-12-31"
    },
    {
      "institution": "Purdue University",
      "area": "West Lafayette, IN",
      "studyType": "B.S. Electrical Engeering",
      "startDate": "1992-12-31",
      "gpa": "",
      "courses": [],
      "endDate": "1995-12-31"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "",
      "keywords": []
    },
    {
      "name": "Amazon Web Services (AWS)",
      "level": "",
      "keywords": []
    },
    {
      "name": "React.js",
      "level": "",
      "keywords": []
    },
    {
      "name": "Agile Methodologies",
      "level": "",
      "keywords": []
    },
    {
      "name": "iOS Development",
      "level": "",
      "keywords": []
    },
    {
      "name": "Database Design",
      "level": "",
      "keywords": []
    },
    {
      "name": "Cloud Computing",
      "level": "",
      "keywords": []
    },
    {
      "name": "JavaScript",
      "level": "",
      "keywords": []
    },
    {
      "name": "Node.js",
      "level": "",
      "keywords": []
    },
    {
      "name": "AngularJS",
      "level": "",
      "keywords": []
    },
    {
      "name": "JSON",
      "level": "",
      "keywords": []
    },
    {
      "name": "HTML5",
      "level": "",
      "keywords": []
    },
    {
      "name": "Cascading Style Sheets (CSS)",
      "level": "",
      "keywords": []
    },
    {
      "name": "Swift (Programming Language)",
      "level": "",
      "keywords": []
    },
    {
      "name": "SQL",
      "level": "",
      "keywords": []
    },
    {
      "name": "NoSQL",
      "level": "",
      "keywords": []
    },
    {
      "name": "Cloud Firestore",
      "level": "",
      "keywords": []
    },
    {
      "name": "Google Material Design",
      "level": "",
      "keywords": []
    },
    {
      "name": "GitHub flow",
      "level": "",
      "keywords": []
    },
    {
      "name": "Git",
      "level": "",
      "keywords": []
    }
  ],
  "volunteer": [
    {
      "company": "Medical Mutts",
      "position": "Volunteer / Board Member",
      "area": "Indianapolis, IN",
      "website": "",
      "startDate": "2018-06-01",
      "summary": "Trained service dogs using 100% force-free training techniques. Fostered dogs. Assisted with fundraising and the search for a new facility.",
      "highlights": []
    }
  ],
  "references": [
    {
      "name": "Richard Cassady - Indigo BioAutomation, Inc.",
      "reference": "Kim is one of the finest software engineers that I have ever worked with in my career. She isn't just a programmer, but a software designer who puts as much thought into overall system design as she does in the code itself. She maintains very high standards for her code craft. She stays up on the latest technologies, and isn't afraid to delve into unknown areas. She works very well as a development team leader; not only showing leadership when it was needed but also seeking out other developers' ideas, even from those who were less experienced than herself. As the QA team leader, she would often seek my opinions and suggestions for improving the overall quality of an application, as well as the software development life cycle used within our organization. I would happily work with Kim again in the future."
    }
  ]
}
